{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "sequence1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "name": "sequence1"}, "inbound_nodes": []}, {"name": "sequence2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "name": "sequence2"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": false, "batch_input_shape": [null, 20], "dtype": "float32", "input_dim": 85876, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 20}, "inbound_nodes": [[["sequence1", 0, 0, {}]], [["sequence2", 0, 0, {}]]]}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 50, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["embedding_1", 0, 0, {}]], [["embedding_1", 1, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_1", 1, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAoAAABDAAAAc0IAAAB0AKABdABqAnQAoAN8AGQBZAGFAmQBfAGFAmYCGQB8\nAGQBZAGFAnwBZAGFAmYCGQAYAKEBZAJkA2QEjQMLAKEBUwApBfpCIEhlbHBlciBmdW5jdGlvbiBm\nb3IgdGhlIHNpbWlsYXJpdHkgZXN0aW1hdGUgb2YgdGhlIExTVE1zIG91dHB1dHMgTukBAAAAVCkC\n2gRheGlz2ghrZWVwZGltcykE2gFL2gNleHDaA3N1bdoDYWJzKQLaAXjaC2hpZGRlbl9zaXplqQBy\nCwAAAPoRbWFuaGF0dGFuX2xzdG0ucHnaH2V4cG9uZW50X25lZ19tYW5oYXR0YW5fZGlzdGFuY2UZ\nAAAAcwIAAAAAAg==\n", [50], null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}], "input_layers": [["sequence1", 0, 0], ["sequence2", 0, 0]], "output_layers": [["lambda_1", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}